theapi/stm32/L053C8/L053C8_LCD_S301C31TR/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l0xx_hal.h"
#include "lcd.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_LCD_Init();

  /* USER CODE BEGIN 2 */
  //HAL_Delay(1);
  //LCD->RAM[LCD_RAM_REGISTER0] = 0x00000003;
  //HAL_LCD_UpdateDisplayRequest(&hlcd);

  //uint32_t data = 0x000000FF;
  //uint32_t data = 0xFFFFFFFF;
  //uint32_t data = 0b00000000000000000000000001110111;
 // uint32_t data = 0b00000000000000000000000000010100;
  //HAL_LCD_Write(&hlcd, LCD_RAM_REGISTER0, LCD_RAM_SEGMENT_DATA_Msk, data);
  //HAL_LCD_UpdateDisplayRequest(&hlcd);

  /*

             A
        ----------
        |         |
       F|         |B
        |         |
        -----G-----
        |         |
       E|         |C
        |         |  _
        ----------- |_|DP
             D

   */

  // Segment pin mappings
  const uint32_t seg_e1  = 0b00000000000000000000000000000001; /* LCD_SEG0 */
  const uint32_t seg_d1  = 0b00000000000000000000000000000010; /* LCD_SEG1 */
  const uint32_t seg_c1  = 0b00000000000000000000000000000100; /* LCD_SEG2 */
  const uint32_t seg_dp1 = 0b00000000000000000000000000001000; /* LCD_SEG3 */
  const uint32_t seg_b1  = 0b00000000000000000000000000010000; /* LCD_SEG4 */
  const uint32_t seg_a1  = 0b00000000000000000000000000100000; /* LCD_SEG5 */
  const uint32_t seg_f1  = 0b00000000000000000000000001000000; /* LCD_SEG6 */
  const uint32_t seg_g1  = 0b00000000000000000000000010000000; /* LCD_SEG7 */
//const uint32_t seg_g1  = 0b00000000000000000000000100000000; /* LCD_SEG8 */

  const uint32_t character_map[11] = {
      seg_a1 | seg_b1 | seg_c1 | seg_d1 | seg_e1 | seg_f1,          /* 0 */
      seg_b1 | seg_c1,                                              /* 1 */
      seg_a1 | seg_b1 | seg_g1 | seg_e1 | seg_d1,                   /* 2 */
      seg_a1 | seg_b1 | seg_g1 | seg_c1 | seg_d1,                   /* 3 */
      seg_f1 | seg_b1 | seg_g1 | seg_c1,                            /* 4 */
      seg_a1 | seg_f1 | seg_g1 | seg_c1 | seg_d1,                   /* 5 */
      seg_f1 | seg_e1 | seg_g1 | seg_c1 | seg_d1,                   /* 6 */
      seg_a1 | seg_b1 | seg_c1,                                     /* 7 */
      seg_a1 | seg_b1 | seg_c1 | seg_d1 | seg_e1 | seg_f1 | seg_g1, /* 8 */
      seg_a1 | seg_b1 | seg_c1 | seg_f1 | seg_g1,                   /* 9 */
      seg_dp1,                                                      /* . */
  };

  int count = 0;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

      /* HAL_LCD_Write does not apply changes after the first one, why? */
      /* HAL_LCD_Write(&hlcd, LCD_RAM_REGISTER0, LCD_RAM_SEGMENT_DATA_Msk, character_map[0]); */
      LCD->RAM[LCD_RAM_REGISTER0] = character_map[count];
      HAL_LCD_UpdateDisplayRequest(&hlcd);
      HAL_Delay(1000);

      count++;
      if (count > 10) {
          count = 0;
      }

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_5;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */

  /* User can add his own implementation to report the HAL error return state */

  while(1) 
  {
      //HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
      HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
      HAL_Delay(150);

  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
